In [23]:
import pandas as pd
import numpy as np

In [2]:
# psam_pusa = pd.read_csv("data/census/psam_pusa.csv")

In [51]:
# temp = pd.read_csv("data/census/ss10pusa.csv")
# AGEP,WKHP,PERNP,WKW,ADJINC,SCHL,FOD1P,FOD2P
cols_to_keep = ["AGEP", "FOD1P", "WAGP", "SCHL", "COW", "SEX"]
temp_df2020 = pd.read_csv('data/census/psam_pusa.csv', usecols = cols_to_keep)

In [52]:
temp_df2020.head()

   AGEP  COW  SCHL  SEX    WAGP   FOD1P
0    68  NaN  16.0    1     0.0     NaN
1    18  1.0  18.0    2  4800.0     NaN
2    35  NaN  16.0    2     0.0     NaN
3    46  NaN  18.0    2     0.0     NaN
4    79  NaN  22.0    2     0.0  2301.0

In [4]:
majors_list = pd.read_csv("data/raw/majors-list.csv")
majors_list.head()

,FOD1P,Major,Major_Category
0,1100,GENERAL AGRICULTURE,Agriculture & Natural Resources
1,1101,AGRICULTURE PRODUCTION AND MANAGEMENT,Agriculture & Natural Resources
2,1102,AGRICULTURAL ECONOMICS,Agriculture & Natural Resources
3,1103,ANIMAL SCIENCES,Agriculture & Natural Resources
4,1104,FOOD SCIENCE,Agriculture & Natural Resources

In [53]:
# Drop all the na value in field of degree
temp_df2020 = temp_df2020.dropna(axis = 0)

In [17]:
# Only get the major code, major name, and major category
grad_students = pd.read_csv("data/raw/grad-students.csv")
grad_students2 = grad_students[["Major_code", "Major", "Major_category"]]
grad_students2.head()

,Major_code,Major,Major_category
0,5601,CONSTRUCTION SERVICES,Industrial Arts & Consumer Services
1,6004,COMMERCIAL ART AND GRAPHIC DESIGN,Arts
2,6211,HOSPITALITY MANAGEMENT,Business
3,2201,COSMETOLOGY SERVICES AND CULINARY ARTS,Industrial Arts & Consumer Services
4,2001,COMMUNICATION TECHNOLOGIES,Computers & Mathematics

In [54]:
# Give the major name and major category to the temp table
temp_df2020b = pd.merge(temp_df2020, grad_students2, left_on = "FOD1P", right_on = "Major_code")
temp_df2020b

,AGEP,COW,SCHL,SEX,WAGP,FOD1P,Major_code,Major,Major_category
0,27,1.0,22.0,2,0.0,6207.0,6207,FINANCE,Business
1,27,1.0,22.0,2,0.0,6207.0,6207,FINANCE,Business
2,25,1.0,21.0,1,30500.0,6207.0,6207,FINANCE,Business
3,37,2.0,21.0,2,60000.0,6207.0,6207,FINANCE,Business
4,57,6.0,21.0,1,0.0,6207.0,6207,FINANCE,Business
...,...,...,...,...,...,...,...,...,...
289734,40,1.0,21.0,1,50000.0,2403.0,2403,ARCHITECTURAL ENGINEERING,Engineering
289735,78,7.0,21.0,1,10400.0,2403.0,2403,ARCHITECTURAL ENGINEERING,Engineering
289736,58,7.0,21.0,1,21600.0,2403.0,2403,ARCHITECTURAL ENGINEERING,Engineering
289737,25,1.0,22.0,1,40000.0,2403.0,2403,ARCHITECTURAL ENGINEERING,Engineering
289738,61,1.0,21.0,1,100000.0,2403.0,2403,ARCHITECTURAL ENGINEERING,Engineering

In [55]:
# Convert integer value to words
temp_df2020b["COW"] = np.where((temp_df2020b["COW"] == 9) | (temp_df2020b["COW"] == 8), "Unemployed", "Employed")
temp_df2020b

,AGEP,COW,SCHL,SEX,WAGP,FOD1P,Major_code,Major,Major_category
0,27,Employed,22.0,2,0.0,6207.0,6207,FINANCE,Business
1,27,Employed,22.0,2,0.0,6207.0,6207,FINANCE,Business
2,25,Employed,21.0,1,30500.0,6207.0,6207,FINANCE,Business
3,37,Employed,21.0,2,60000.0,6207.0,6207,FINANCE,Business
4,57,Employed,21.0,1,0.0,6207.0,6207,FINANCE,Business
...,...,...,...,...,...,...,...,...,...
289734,40,Employed,21.0,1,50000.0,2403.0,2403,ARCHITECTURAL ENGINEERING,Engineering
289735,78,Employed,21.0,1,10400.0,2403.0,2403,ARCHITECTURAL ENGINEERING,Engineering
289736,58,Employed,21.0,1,21600.0,2403.0,2403,ARCHITECTURAL ENGINEERING,Engineering
289737,25,Employed,22.0,1,40000.0,2403.0,2403,ARCHITECTURAL ENGINEERING,Engineering
289738,61,Employed,21.0,1,100000.0,2403.0,2403,ARCHITECTURAL ENGINEERING,Engineering

In [56]:
# number of employed people
np.sum(temp_df2020b["COW"] == "Employed")

288228

## Data from 2010

In [65]:
temp_df2010 = pd.read_csv('data/census/ss10pusa.csv', usecols = cols_to_keep) 
temp_df2010.head()

   AGEP  COW  SCHL  SEX     WAGP   FOD1P
0    75  NaN  16.0    2      0.0     NaN
1    25  4.0  22.0    1  17000.0  5007.0
2    26  4.0  19.0    2  13000.0     NaN
3     3  NaN   1.0    1      NaN     NaN
4    87  NaN  19.0    2      0.0     NaN

In [86]:
# function to combine two datasets then we have a new dataset with defined values instead of integer value
def combine2table(table1, table2):
    table1 = table1.dropna(axis = 0)
    
    # convert employment structure
    result = pd.merge(table1, table2, left_on = "FOD1P", right_on = "Major_code")
    result["COW"] = np.where((result["COW"] == 9) | (result["COW"] == 8), "Unemployed", "Employed")
    
    # convert education attainment
    result = result.loc[(result["SCHL"] == 21) | (result['SCHL'] == 22)]
    result["SCHL"] = np.where(result["SCHL"] == 21, "Bachelor", "Master")
    return result

In [87]:
temp_df2010b = combine2table(temp_df2010, grad_students2)
temp_df2010b

,AGEP,COW,SCHL,SEX,WAGP,FOD1P,Major_code,Major,Major_category
0,25,Employed,Master,1,17000.0,5007.0,5007,PHYSICS,Physical Sciences
1,34,Employed,Master,2,39000.0,5007.0,5007,PHYSICS,Physical Sciences
2,53,Employed,Bachelor,1,50000.0,5007.0,5007,PHYSICS,Physical Sciences
4,32,Employed,Master,2,22000.0,5007.0,5007,PHYSICS,Physical Sciences
6,53,Employed,Master,1,128000.0,5007.0,5007,PHYSICS,Physical Sciences
...,...,...,...,...,...,...,...,...,...
282608,27,Employed,Master,1,30000.0,4006.0,4006,COGNITIVE SCIENCE AND BIOPSYCHOLOGY,Biology & Life Science
282609,39,Employed,Master,1,225000.0,4006.0,4006,COGNITIVE SCIENCE AND BIOPSYCHOLOGY,Biology & Life Science
282611,29,Employed,Bachelor,1,26500.0,4006.0,4006,COGNITIVE SCIENCE AND BIOPSYCHOLOGY,Biology & Life Science
282614,32,Employed,Master,2,69000.0,4006.0,4006,COGNITIVE SCIENCE AND BIOPSYCHOLOGY,Biology & Life Science
282615,29,Employed,Bachelor,1,42000.0,4006.0,4006,COGNITIVE SCIENCE AND BIOPSYCHOLOGY,Biology & Life Science

In [61]:
np.sum(temp_df2010b["COW"] == "Employed")

281104

In [88]:
# # np.unique(temp_df2010b["SCHL"])
# temp_dff = temp_df2010b.copy()
# # Only get the Bachelor and Master degree
# temp_dff = temp_dff.loc[(temp_dff["SCHL"] == 21) | (temp_dff['SCHL'] == 22)]
# temp_dff["SCHL"] = np.where(temp_dff["SCHL"] == 21, "Bachelor", "Master")
# # np.unique(temp_dff["SCHL"])
# temp_dff